{
  "backend/main.mo": "Defines the actor’s full data model including leads, customers, attendance, messaging, queries, templates, and storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for many frontend files describing their functionality and recent changes.",
  "frontend/index.css": "Tailwind CSS base definitions and OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app at #root and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with CRM and customer routes, global theming, error boundary, and app layout.",
  "frontend/src/components/AdminSection.tsx": "Empty component file with no implemented logic.",
  "frontend/src/components/AgentPanelSection.tsx": "Implements agent management UI with search, approval actions, and statistics using backend query hooks.",
  "frontend/src/components/AttendanceSection.tsx": "Provides attendance tracking UI with check‑in/out, camera capture, geolocation, record tables, and CSV export.",
  "frontend/src/components/CustomerAppLinkSection.tsx": "Displays a sharable customer portal link with copy and open actions and usage instructions.",
  "frontend/src/components/CustomerQueriesSection.tsx": "Manages customer queries for admins and agents, including creation, validation, listing, and status updates.",
  "frontend/src/components/CustomersSection.tsx": "Provides paginated customer management with listing, adding new customers, and form handling.",
  "frontend/src/components/DashboardOverview.tsx": "Shows key CRM metrics such as customer counts, leads, queries, and follow‑ups with loading skeletons.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches UI errors and displays a recovery interface with reload and reset options.",
  "frontend/src/components/FollowUpsSection.tsx": "Handles scheduling, listing, and completing follow‑up tasks tied to customers and leads.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright info and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the main header with branding, user profile display, theme toggle, and logout handling.",
  "frontend/src/components/LeadsSection.tsx": "Displays and manages leads with filtering, pagination, creation, status updates, and assignment features.",
  "frontend/src/components/MessagingSection.tsx": "Provides a messaging interface with conversation selection, message viewing, sending, and participant search.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for first‑time users to enter and save their name, email, and role.",
  "frontend/src/components/TemplatesSection.tsx": "Manages message templates by category, allowing creation, copying, and setting default follow‑up templates.",
  "frontend/src/components/TicketsSection.tsx": "Empty placeholder component for ticket functionality.",
  "frontend/src/components/WhatsAppLogsSection.tsx": "Shows WhatsApp follow‑up message logs for admins or agents, with timestamps, statuses, and linked lead names.",
  "frontend/src/components/WhatsAppSection.tsx": "UI for configuring WhatsApp API settings and sending manual WhatsApp messages using customers and templates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCustomerAuth.ts": "Manages customer phone-based auth via localStorage and provides login, logout, registration, and profile query hooks.",
  "frontend/src/hooks/useCustomerQueries.ts": "Provides hooks for submitting customer queries, fetching queries by phone number, and retrieving confirmation messages.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for Internet Identity login, storing identities, and managing authentication state.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for fetching and mutating user, customer, lead, WhatsApp, attendance, and other backend data.",
  "frontend/src/index.css": "Tailwind CSS base configuration defining color variables and light/dark theme styles.",
  "frontend/src/lib/csvUtils.ts": "Generates and downloads a CSV attendance report by formatting record fields and constructing a blob for download.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider wrapping the root component.",
  "frontend/src/pages/ApprovalPendingPage.tsx": "Empty page file with no implementation.",
  "frontend/src/pages/CRMApp.tsx": "Handles authentication flow, profile fetching, error states, and routes users to login or dashboard.",
  "frontend/src/pages/CustomerDashboard.tsx": "Renders customer dashboard with tabs, forms for submitting queries, profile display, and logout handling.",
  "frontend/src/pages/CustomerLoginPage.tsx": "Provides customer login and registration forms with validation and mutation triggers.",
  "frontend/src/pages/CustomerPortal.tsx": "Controls customer authentication flow, showing loader, errors, login, or dashboard based on state.",
  "frontend/src/pages/Dashboard.tsx": "Displays main dashboard with multiple tabbed sections and admin‑conditional views.",
  "frontend/src/pages/LoginPage.tsx": "Manages Internet Identity login and user profile setup with validation and save operations.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and remove them from hash-based routes.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, known issues, and feature requirements related to fixing dashboard load failures and improving error messaging."
}