{
  "backend/main.mo": "Defines the backend actor and all core CRM types including leads, customers, attendance, messaging, templates, and authorization-related records.",
  "feature_evidence.json": "Lists feature evidence records mapping features to affected frontend files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Contains human‑written summaries for many frontend files describing their purpose, UI behavior, and data‑loading patterns.",
  "frontend/index.css": "Defines global Tailwind CSS styles and OKLCH-based color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the root React application and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with root, CRM, and customer routes wrapped in a themed ErrorBoundary.",
  "frontend/src/components/AdminSection.tsx": "Empty placeholder file for an admin UI section.",
  "frontend/src/components/AgentPanelSection.tsx": "Implements agent management UI with filtering, stats, approval actions, and status badges.",
  "frontend/src/components/AttendanceSection.tsx": "Handles attendance tracking with camera capture, geolocation, admin reporting, pagination, and skeleton loading.",
  "frontend/src/components/CustomerAppLinkSection.tsx": "Displays a generated customer portal link with copy and open actions plus usage instructions.",
  "frontend/src/components/CustomerQueriesSection.tsx": "Lists and manages customer queries for admins or agents, with creation and status update capabilities.",
  "frontend/src/components/CustomersSection.tsx": "Shows paginated customers and provides a dialog to add new customers with basic details.",
  "frontend/src/components/DashboardLoadErrorState.tsx": "Renders an error state card with retry controls and optional technical details for dashboard load failures.",
  "frontend/src/components/DashboardOverview.tsx": "Fetches and displays CRM overview metrics using cards with skeleton loading states.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches rendering errors and shows a fallback UI with reload and reset options.",
  "frontend/src/components/FollowUpsSection.tsx": "Displays and manages customer follow-ups, including scheduling, listing, sorting, and marking tasks complete.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the top navigation with user info, theme toggle, and logout functionality.",
  "frontend/src/components/LeadsSection.tsx": "Handles lead listing, creation, status updates, assignment, and pagination filtering by status.",
  "frontend/src/components/MessagingSection.tsx": "Provides a messaging interface with conversations, message history, search, and sending messages.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to set up their profile with name, email, and role before accessing the app.",
  "frontend/src/components/TemplatesSection.tsx": "UI for viewing, creating, copying, and setting default message templates by category using query hooks.",
  "frontend/src/components/TicketsSection.tsx": "Empty file with no implemented content.",
  "frontend/src/components/WhatsAppLogsSection.tsx": "Displays WhatsApp message logs, switching between admin and agent views, with sorting and lead name resolution.",
  "frontend/src/components/WhatsAppSection.tsx": "Manages WhatsApp integration settings and allows manual message sending using templates and customer selection.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useCustomerAuth.ts": "Handles customer auth via localStorage plus login, registration, logout, and profile queries with backend validation.",
  "frontend/src/hooks/useCustomerQueries.ts": "Provides hooks for submitting customer queries, fetching them by phone number, and retrieving a confirmation message.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity initialization logic.",
  "frontend/src/hooks/useLoadTimeout.ts": "Implements a timer hook that tracks whether a loading operation has exceeded a configurable timeout.",
  "frontend/src/hooks/useQueries.ts": "Defines numerous React Query hooks for fetching and mutating backend data, including user profiles, admin checks, and overview metrics.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables for light and dark modes.",
  "frontend/src/lib/csvUtils.ts": "Generates and triggers download of an attendance report CSV built from backend data.",
  "frontend/src/main.tsx": "Initializes the app root with React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/ApprovalPendingPage.tsx": "Empty page file with no implementation.",
  "frontend/src/pages/CRMApp.tsx": "Controls high-level app flow based on authentication and profile loading states, showing login, dashboard, or error screens as needed.",
  "frontend/src/pages/CustomerDashboard.tsx": "Renders a customer-facing dashboard with profile info, query submission forms, theme toggling, and logout functionality.",
  "frontend/src/pages/CustomerLoginPage.tsx": "Implements customer login and registration forms with validation and mutation hooks for authentication.",
  "frontend/src/pages/CustomerPortal.tsx": "Determines whether to show the customer login page, dashboard, or loading/error states based on auth status.",
  "frontend/src/pages/Dashboard.tsx": "Renders the admin/agent dashboard with multiple tabbed sections and tracks visited tabs, with admin-only panels.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login and user profile setup, validating and saving profile details when needed.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, removing, and managing URL parameters including secret one-time parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Metadata describing project state, issues, and feature requests related to improving dashboard load performance."
}