{
  "backend/main.mo": "Defines the main Motoko actor with all CRM types including leads, customers, attendance, messaging, templates, WhatsApp config, and agent info.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains textual summaries for many frontend files describing their purpose and behavior in the app.",
  "frontend/index.css": "Tailwind-based global CSS defining OKLCH color variables for light and dark themes and base styling.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with CRM and customer portal routes wrapped in ThemeProvider and ErrorBoundary.",
  "frontend/src/components/AdminSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/AgentPanelSection.tsx": "Agent management UI showing agent stats, searchable agent list, and approve/reject actions using backend mutations.",
  "frontend/src/components/AttendanceSection.tsx": "Attendance UI handling check-in/out with camera capture, geolocation, admin reporting, and paginated attendance records.",
  "frontend/src/components/CustomerAppLinkSection.tsx": "Displays and manages a sharable customer portal link with copy and open actions.",
  "frontend/src/components/CustomerQueriesSection.tsx": "Admin/agent interface to view, create, and update customer queries with validation and status management.",
  "frontend/src/components/CustomersSection.tsx": "Paginated customer list with a dialog to add new customers and manage basic details.",
  "frontend/src/components/DashboardOverview.tsx": "Shows key CRM metrics including customers, leads, queries, and follow-ups with loading skeletons.",
  "frontend/src/components/ErrorBoundary.tsx": "Captures rendering errors and displays a recovery screen with reload and reset options.",
  "frontend/src/components/FollowUpsSection.tsx": "Manages scheduling, listing, and completing follow-up tasks linked to customers or leads.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and a link attribution.",
  "frontend/src/components/Header.tsx": "Renders the app header with branding, theme toggle, user avatar, profile details, and logout handling.",
  "frontend/src/components/LeadsSection.tsx": "Displays paginated leads filtered by status, with creation, updating, and assignment actions using dialogs and forms.",
  "frontend/src/components/MessagingSection.tsx": "Provides a messaging UI to view conversations, read messages, and send new ones with conversation filtering and auto-scroll.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for first-time profile setup allowing users to enter name, email, and role before saving.",
  "frontend/src/components/TemplatesSection.tsx": "Manages message templates by category with create, copy, and default-selection features for admins and agents.",
  "frontend/src/components/TicketsSection.tsx": "Empty component placeholder for ticket-related functionality.",
  "frontend/src/components/WhatsAppLogsSection.tsx": "Shows WhatsApp follow-up message logs for admins or agents, including timestamps, lead links, and status badges.",
  "frontend/src/components/WhatsAppSection.tsx": "UI for configuring WhatsApp API, selecting templates, and sending manual WhatsApp messages to customers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCustomerAuth.ts": "Manages customer phone-based auth in localStorage and provides login, logout, and profile fetch hooks using the backend actor.",
  "frontend/src/hooks/useCustomerQueries.ts": "Provides hooks for submitting customer queries, retrieving query history, and fetching a confirmation message via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider with login, logout, identity persistence, and context access for authentication state.",
  "frontend/src/hooks/useQueries.ts": "Collection of backend data hooks for users, customers, leads, WhatsApp config, metrics, and other entities using the actor.",
  "frontend/src/index.css": "Tailwind base/styles plus CSS variables defining color themes for light and dark modes.",
  "frontend/src/lib/csvUtils.ts": "Generates a CSV attendance report from record data, formats fields, and triggers a file download with a timestamped filename.",
  "frontend/src/main.tsx": "Bootstraps the React app by setting up React Query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/ApprovalPendingPage.tsx": "Empty placeholder page with no content.",
  "frontend/src/pages/CRMApp.tsx": "Handles authentication and user profile loading to conditionally render login, loading states, errors, or the main dashboard.",
  "frontend/src/pages/CustomerDashboard.tsx": "Displays customer profile, query submission forms, and logout options with tabbed sections for rent, sales, and interior queries.",
  "frontend/src/pages/CustomerLoginPage.tsx": "Provides customer login and registration forms with validation and integration to auth hooks.",
  "frontend/src/pages/CustomerPortal.tsx": "Routes users to login, dashboard, or error/loading states based on customer authentication status.",
  "frontend/src/pages/Dashboard.tsx": "Main CRM dashboard with tabbed navigation for leads, customers, queries, attendance, and admin-only sections.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login and prompts authenticated users to complete their profile if missing.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, storing them in sessionStorage, and clearing them for persistent state handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color variables, animations, and plugins.",
  "project_state.json": "Stores project metadata, known issues, and feature requests related to improving dashboard load performance."
}