{
  "kind": "build_request",
  "title": "Fix CRM dashboard failing to load after a full page refresh",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the issue where the CRM Dashboard does not load on a fresh page load (hard refresh) for an authenticated user. The app must reliably reach the Dashboard after refresh, or show a clear recoverable error state (with retry) instead of getting stuck or rendering blank.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Dashboard is not loading on fresh page, please fix the issue and rephrase this"
        ]
      },
      "acceptanceCriteria": [
        "Given a user is already authenticated via Internet Identity, hard-refreshing the page on the CRM app route ('/') results in the Dashboard rendering successfully.",
        "If an error occurs during initialization (e.g., actor initialization or profile query), the UI shows an error state with a Retry action and does not remain in an infinite loading state or a blank screen.",
        "The fix does not require manual navigation (e.g., switching tabs) to trigger the Dashboard to appear."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Rephrase the user-facing text related to the dashboard-load failure to be clear, professional English. Update the relevant error/alert copy shown when the profile/dashboard cannot be loaded so it communicates the problem and next step (retry) succinctly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "...please fix the issue and rephrase this"
        ]
      },
      "acceptanceCriteria": [
        "The error state shown on dashboard/profile load failure uses clear English phrasing (no awkward grammar) and includes an explicit next step (e.g., retry).",
        "All user-facing text introduced/edited by this change is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not edit immutable hook/bootstrap files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Resolving Caffeine internal build/deploy configuration errors (these require the Caffeine team).",
    "Adding new product features unrelated to dashboard load reliability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}