{
  "kind": "build_request",
  "title": "Speed up Admin/Agent dashboard load after Internet Identity login",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Reduce dashboard bootstrap latency by preventing `useActor()` from force-refetching all React Query queries immediately after the actor becomes available; instead, only invalidate dependent queries (or refetch a minimal, explicitly-defined set) so the dashboard can render quickly after login.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "After login Admin dashboard and agent dashboard not opening quickly, is is taking too much time. Please fix the issue"
        ]
      },
      "acceptanceCriteria": [
        "After successful Internet Identity login, the app navigates to the CRM dashboard without a long blank/loading delay caused by an app-wide query refetch storm.",
        "`frontend/src/hooks/useActor.ts` no longer calls a broad `refetchQueries` for all non-actor queries on actor creation; any refetching is limited and intentional.",
        "Existing data freshness behavior is preserved via React Query invalidation, and core dashboard data still loads correctly when the relevant components mount."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Prevent `useActor()` from blocking initial dashboard load on access-control initialization when no admin token is present by skipping the `_initializeAccessControlWithSecret` call if the `caffeineAdminToken` secret parameter is missing/empty, and ensure failures in that initialization do not prevent normal users from reaching their dashboards.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Dashboard page should be open quick after login.",
          "After login Admin dashboard and agent dashboard not opening quickly, is is taking too much time. Please fix the issue"
        ]
      },
      "acceptanceCriteria": [
        "When `caffeineAdminToken` is not provided, `_initializeAccessControlWithSecret` is not called (or is handled in a non-blocking way) and the actor is still created successfully.",
        "A missing/invalid token does not delay or block dashboard rendering for non-admin users.",
        "Admin functionality still works when a valid `caffeineAdminToken` is present."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve dashboard bootstrap resilience and perceived performance by ensuring the UI can show the dashboard shell quickly while essential data loads, using existing loading/skeleton patterns (e.g., keep `DashboardOverview` skeletons) and avoiding full-screen loading states longer than necessary once authentication is complete.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Dashboard page should be open quick after login."
        ]
      },
      "acceptanceCriteria": [
        "After authentication completes, the user sees a responsive dashboard shell (header/tabs/layout) promptly, while metrics/sections load with skeletons rather than blocking the entire screen.",
        "No regression: if user profile is missing, the profile setup flow still appears as before.",
        "The existing timeout/error state (`DashboardLoadErrorState`) still triggers appropriately when there is a genuine load failure."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo`; add `backend/migration.mo` only if state schema upgrades are required.",
    "Do not edit any frontend files under `frontend/src/components/ui` or any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing new features unrelated to dashboard load performance (e.g., new CRM modules, new authentication providers).",
    "Adding external databases, third-party real-time systems, or non-Internet-Identity auth.",
    "Fixing unspecified production deployment errors without an actual error message/log; this request focuses on dashboard slowness after login."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}