{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix CRM Dashboard blank/stuck state after hard refresh for authenticated users",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the CRM app reliably boots into the Dashboard after a hard refresh for authenticated users, with a non-blocking error + retry state if initialization fails.",
      "acceptanceCriteria": [
        "Given a user is already authenticated via Internet Identity, hard-refreshing the page on the CRM app route ('/') results in the Dashboard rendering successfully.",
        "If an error occurs during initialization (e.g., actor initialization or profile query), the UI shows an error state with a Retry action and does not remain in an infinite loading state or a blank screen.",
        "The fix does not require manual navigation (e.g., switching tabs) to trigger the Dashboard to appear."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden the dashboard bootstrap/profile-loading flow by preventing the current-user profile query from running with an anonymous actor during refresh. Use the authenticated principal (from Internet Identity) to gate the query (enabled) and to scope the queryKey so cached/anonymous results cannot incorrectly drive CRMApp into profile-setup/login states. Ensure the hook's derived isLoading/isFetched reflect actor + identity readiness (per the authorization component guidance). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CRMApp.tsx",
          "operation": "modify",
          "description": "Update CRMApp rendering decisions to align with the hardened profile hook: (1) avoid showing LoginPage or profile-setup decisions until the authenticated profile query has meaningfully fetched for the current identity, (2) ensure any initialization/profile failure renders a clear recoverable error state with a Retry action that triggers an appropriate refetch (and, if needed, clears/retries relevant React Query caches) instead of leaving the UI blank or stuck. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Improve and professionalize the user-facing dashboard/profile load failure messaging and make the retry next-step explicit.",
      "acceptanceCriteria": [
        "The error state shown on dashboard/profile load failure uses clear English phrasing (no awkward grammar) and includes an explicit next step (e.g., retry).",
        "All user-facing text introduced/edited by this change is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CRMApp.tsx",
          "operation": "modify",
          "description": "Rephrase the dashboard/profile initialization failure copy in the error Alert (title + description + retry affordance) to clear, professional English that explains the problem succinctly and explicitly instructs the user to retry (and what retry will do). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}